# Завдання 2: Абстракція
# Створіть клас "Фігура" (Shape), який буде абстрактним класом. 
# У цьому класі визначіть абстрактний метод "обчислити_площу" (calculate_area).
# Створіть підкласи цього класу для різних геометричних фігур, 
# наприклад, "Коло" (Circle), "Прямокутник" (Rectangle) і "Трикутник" (Triangle). 
# У кожному з підкласів реалізуйте метод "обчислити_площу" відповідно до формули для обчислення площі кожної фігури.
# Створіть об'єкти кожного з підкласів і використайте метод "обчислити_площу", щоб вивести площу кожної фігури на екран.